Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: - Field names should stick to the same character set as schema names (NSID name segments): ASCII alphanumeric, first character not a digit, no hyphens, case-sensitive - Exceptions may be justifiable in some situations, such as preservation of names in existing external schemas - Data objects should never contain schema-specified field names starting with `$` at any level of nesting; these are reserved for future protocol-level extensions
ja: - フィールド名はスキーマ名（NSIDの名前セグメント）と同じ文字セットに従う必要があります。すなわち、ASCII英数字、最初の文字は数字ではない、ハイフンなし、大文字小文字を区別 - 既存の外部スキーマの名前を保持する場合など、例外が正当化されることもあります - データオブジェクトはネストのいかなるレベルでも`$`で始まるフィールド名を含むようなスキーマを指定してはいけません。これらは将来のプロトコルレベルの拡張用に予約されています。

source: - For your app's signup flow, you will need users to log in or create an account. We generally recommend hosting your own PDS alongside your app to allow first-time users of the Atmosphere — who may not yet be aware of the concept of a PDS — to sign up directly within your application. Your PDS and AppView should have [different domain names](/going-to-production#domain-names).
ja: - アプリのサインアップフローでは、ユーザーがログインまたはアカウント作成を行う必要があります。Atmosphereを初めて利用するユーザー（まだPDSの概念を知らない可能性がある）に対してアプリ内で直接サインアップさせるため、アプリと一緒にPDSもホストすることを一般的に推奨します。PDSとAppViewは[異なるドメイン名](/going-to-production#domain-names)を使用してください。

source: - Given a DID, check your current 'revision' for that DID (Each change to a repo is tagged with a 'revision' or 'rev' string that is a lexicographically sortable timestamp). - If you do not have a rev for that repo, download and process the users repo checkpoint from the `com.atproto.sync.getRepo` endpoint. - While you are doing that, buffer any events for the repo to go through after the checkpoint has been processed. - The checkpoint will contain a rev value that you can use to skip any buffered events that have already been included in said checkpoint. - For each buffered event, if the rev is less than the current rev you have, you can safely skip it.
ja: - DIDが与えられた場合、そのDIDの現在のリビジョンを確認します（リポジトリへのすべての変更は、辞書順でソート可能なタイムスタンプである「rev」文字列でタグされます）。 - そのリポジトリのrevがない場合は、`com.atproto.sync.getRepo`エンドポイントからユーザーのリポジトリチェックポイントをダウンロードして処理します。 - その間、チェックポイント以降に通過するリポジトリイベントをバッファします。 - チェックポイントにはrevが含まれており、そのチェックポイントに既にあるイベントをバッファからスキップするのに使用できます。 - バッファされた各イベントについて、そのイベントのrevが現在のrevより小さい場合、安全にスキップできます。

source: - Harassment: `blurs=content` + `severity=alert` - Spider warning: `blurs=media` + `severity=alert` - Misinformation: `blurs=none` + `severity=alert` - Verified user: `blurs=none` + `severity=inform` - Curational down-regulate: `blurs=none` + `severity=none`
ja: - ハラスメント：`blurs=content` + `severity=alert` - 蜘蛛注意：`blurs=media` + `severity=alert` - 誤情報：`blurs=none` + `severity=alert` - 認証済ユーザー：`blurs=none` + `severity=inform` - キュレーション優先度低：`blurs=none` + `severity=none`

source: - Logged in via OAuth - Created a custom schema - Read & written records for the logged in user
ja: - OAuthでログイン - カスタムスキーマを作成 - ログインしたユーザーのレコードの読み取りと書き込み

source: - Many applications and projects will have multiple distinct functions or features, and schemas of all types can have that grouping represented in the NSID hierarchy - eg `app.bsky.feed.*` , `app.bsky.graph.*` - Very simple applications can include all endpoints under a single NSID “group” - use a `.defs` schema for definitions which might be reused by multiple schemas in the same namespace, or by third parties - eg `app.bsky.feed.defs` - putting these in a separate schema file means that deprecation or removal of other schema files doesn’t impact reuse - Avoid conflicts and confusion between groups, names, and definitions - eg `app.bsky.feed.post#main` vs `app.bsky.feed.post.main`, or `com.example.record#foo` and `com.example.record.foo` - or defining both `app.bsky.feed` (as a record) and `app.bsky.feed.post` (with `app.bsky.feed` as a group)
ja: - 多くのアプリケーションやプロジェクトは複数の異なる機能を持つため、どのタイプのスキーマもNSIDの階層でグループを表現できます - 例：`app.bsky.feed.*`、`app.bsky.graph.*` - 非常に単純なアプリケーションであれば、すべてのエンドポイントを単一のNSIDグループに含めることができます- - 同じ名前空間内の複数のスキーマまたはサードパーティによって再利用される可能性がある定義には、`.defs`スキーマを使用してください - 例：`app.bsky.feed.defs` - 個別のスキーマファイルに切り出すと、他のスキーマファイルの廃止や削除が再利用に影響しなくなります - グループ、名前、および定義間の競合や混同を避けてください - 例：`app.bsky.feed.post#main`に対する`app.bsky.feed.post.main`や、`com.example.record#foo`と`com.example.record.foo`の共存 - または`app.bsky.feed`（レコード）と`app.bsky.feed.post`（`app.bsky.feed`はグループ）の両方を定義すること

source: - On an account: has account-wide effects - On a profile: affects only the profile record (e.g. user avatar) and never hides any content, including the account in listings. - On content: affects the content specifically (a post record, a list, a feed, etc.)
ja: - アカウントに対して：アカウント全体に影響があります。 - プロフィールに対して：プロフィールレコード（例：ユーザーアバター）にのみ影響し、一覧からアカウントを隠すことはありません。 - コンテンツに対して：コンテンツ毎に固有の影響があります（投稿レコード、リスト、フィードなど）。

source: - PDS emits an `#account` event, with `active` false and status `deactivated`. - similar to deletion, Relay processes the event, stops redistributing content, and passes through the event. The Relay should not fully purge content locally, though it may eventually delete local copies if the deactivation status persists for a long time (according to local policy). - similar to deletion, `#commit` events should not be emitted by the PDS, and should be ignored and not passed through if received by Relays - downstream services (eg, AppViews) should make content unavailable, but do not need to delete data locally. They should indicate account/content status as "unavailable"; best practice is to specifically indicate that this is due to account deactivation.
ja: - PDSは`#account`イベントを`active`がfalseかつ`deactivated`状態で送信します。 - 削除と同様にリレーはイベントを処理し、コンテンツ再配布は行わず、イベントをパススルーします。リレーはコンテンツを消去しませんが、長期間無効化されたままであれば削除するかもしれません（ポリシー次第）。 - 削除と同様、`#commit`イベントはPDSから送信されず、リレーは受信したとしても無視し、パススルーしません。 - 下流サービス（例：AppView）はコンテンツを利用不可にしますが、ローカルから削除する必要はありません。対象のアカウントやコンテンツのステータスとして"unavailable"を示します。ベストプラクティスは、アカウント無効化によるものだと提示することです。

source: - PDS emits an `#account` event, with `active` false and status `deleted`. - Relay updates local account status for the repo, and passes through the `#account` event. If the Relay is a full mirror, it immediately stops serving `getRepo`, `getRecord`, and similar API requests for the account, indicating the reason in the response error. The Relay may fully delete repo content locally according to local policy. The firehose backfill window does not need to be immediately purged of commit events for the repo, as long as the backfill window is time-limited. - the PDS should not emit `#commit` events for an account which is not "active'. If any further `#commit` messages are emitted for the repo (eg, by accident or out-of-order processing or delivery), all downstream services should ignore the event and not pass it through - downstream services (eg, AppView) **should** immediately stop serving/distributing content for the account. They *may* defer permanent data deletion according to local policy. Updating aggregations (eg, record counts) may also be deferred or processed in a background queue according to policy and implementation. Error status messages may indicate either that the content is "gone" (existed, but no longer available), or that content is "not found" (not revealing that content existed previously)
ja: - PDSは`#account`イベントを`active`がfalseかつ`deleted`状態で送信します。 - リレーはローカルのアカウント状態を更新し、`#account`イベントをパススルーします。リレーが完全なミラーの場合、即座に対象アカウントに関する`getRepo`、`getRecord`および類似APIを止め、エラー応答で理由を示します。リレーはポリシーに基づいて、対象リポジトリのコンテンツをローカルで完全に削除するかもしれません。firehoseのバックフィルウィンドウに時間制限があるなら、ウィンドウからそのリポジトリのコミットイベントを即座に削除する必要はありません。 - PDSは`active`ではないアカウントの`#commit`を送信しません。もしそのリポジトリについて（アクシデントや処理または配送の順番乱れによって）何かしら`#commit`が送信されても、下流のサービスはそのイベントを無視し、パススルーもしません。 - 下流のサービス（例：AppView）は即座にそのアカウントのコンテンツ提供や配布を止め**なければいけません**。恒久的なデータ削除はポリシーによって延期する*かもしれません*。集計（例：レコード数）の更新もポリシーや実装によって遅れたりバックグラウンドキューで処理されるかもしれません。エラーメッセージは"gone"（存在するが利用できない）か"not found"（過去に存在したことも明かさない）を示すかもしれません。

source: - PDS emits an `#account` event, with `active` status. - Relay verifies that the account reactivation is valid, eg that it came from the current PDS instance for the identity. It updates local account status, and passes through the event. - any downstream services (eg, AppViews) should update local account status for the account. - any service which does not have any current repo content for the account (eg, because it was previously deleted) may fetch a repo [CAR](/specs/repository#car-file-serialization) export and process it as a background tasks. An “upstream” host (like a relay) may have a repo copy, or the service might connect directly to the account's PDS host. They are not required to do so, and might instead wait for a `#commit` event. - if the account was previously deleted or inactive for a long time, it is a best practice for the PDS to emit an empty `#commit` event after reactivation to ensure downstream services are synchronized.
ja: - PDSは`#account`イベントを`active`状態で送信します。 - リレーはアカウントの再有効化を検証します（イベントがIDの示すPDSから来ていること等）。ローカルのアカウント状態を更新し、イベントをパススルーします。 - 下流サービス（例：AppView）はローカルのアカウント状態を更新します。 - 対象アカウントの最新のコンテンツを持っていないサービス（過去に削除してしまった等）は、リポジトリの[CAR](/specs/repository#car-file-serialization)エクスポートを取得し、バックグラウンドタスクで処理することがあります。（リレーのような）上流のホストはリポジトリのコピーを持っているかもしれませんし、サービスがそのアカウントのPDSに直接接続するかもしれません。これは必須ではなく、代わりに`#commit`イベントを待つこともあります。 - もしアカウントが過去に削除または長期間無効化されていた場合、ベストプラクティスは再有効化後にPDSが`#commit`イベントを送信して、下流サービスに確実に同期させることです。

source: - Schemas & attributes: Use `lowerCamelCase` capitalization for schemas and names (as opposed to `UpperCamelCase`, `snake_case`, `ALL_CAPS`, etc). - API error names: `UpperCamelCase` - Fixed strings (eg `knownValues`): `kebab-case`
ja: - スキーマと属性：スキーマと名前には`lowerCamelCase`を使用してください（`UpperCamelCase`、`snake_case`、`ALL_CAPS`などではなく）。 - APIエラー名：`UpperCamelCase` - 文字列定数（例：`knownValues`）：`kebab-case`

source: - Setting `PDS_SQLITE_DISABLE_WAL_AUTO_CHECKPOINT` = `true` . This is in the [environment variable config](https://github.com/bluesky-social/atproto/blob/f8e56b387fcd3bc8405225c1bbdef66ca5dc1591/packages/pds/src/config/env.ts#L48) for your PDS. What this does is force the PDS SQLite client to keep write-ahead logging open and leave the actual checkpointing to Litestream. - Use [Litestream with systemd](https://litestream.io/guides/systemd/) or another scheduler to find the most recently updated DBs and back them up. By default, individual user databases are located in `/pds/actors/`. Litestream will clean the write-ahead log and checkpoint automatically, so there's no risk of WAL growing out of control. - If needed, ensure that this script also runs on SIGTERM when cleaning up containers or pods from your deployment.
ja: - `PDS_SQLITE_DISABLE_WAL_AUTO_CHECKPOINT` = `true`を設定します。これはPDSの[環境変数設定](https://github.com/bluesky-social/atproto/blob/f8e56b387fcd3bc8405225c1bbdef66ca5dc1591/packages/pds/src/config/env.ts#L48)にあります。これが行うことは、PDS SQLiteクライアントにライトアヘッドログ（WAL）を開いたままにして、実際のチェックポイント処理をLitestreamに任せることを強制することです。

source: - Signin via OAuth {{className: 'lead'}} - Fetch information about users (profiles) {{className: 'lead'}} - Listen to the network firehose for new data {{className: 'lead'}} - Publish data on the user's account using a custom schema {{className: 'lead'}}
ja: - OAuthでサインイン {{className: 'lead'}} - ユーザーに関する情報（プロフィール）を取得する {{className: 'lead'}} - ネットワークfirehoseで新しいデータを継続的に取得する {{className: 'lead'}} - カスタムスキーマを使用してユーザーのアカウントにデータを公開する {{className: 'lead'}}

source: - Specify the format of string fields when appropriate - String fields in records should almost always have a maximum length if they don’t have a format type - Don’t redundantly specify both a format and length limits - If limiting the length of a string for semantic or visual reasons, grapheme limits should be used to ensure a degree of consistency across human languages. A data size (bytes) limit should also be added in these cases. A ratio of between 10 to 20 bytes to 1 grapheme is recommended. - The string and bytes record data types are intended for constrained data size use-cases. For text or binary data of larger size, blob references should be used. This can include longer-form text and structured data. - Enum sets are “closed” and can not be updated or extended without breaking schema evolution rules. For this reason they should almost always be avoided. - For strings, `knownValues` provides more flexible alternative - String `knownValues` may include simple string constants, or may include schema references to a `token` (eg, the string `"com.example.defs#tokenOne"`) - Tokens provide an extension mechanism, and work well for values that have subjective definitions or may be expanded over time - See `com.atproto.moderation.defs#reasonType` and `com.atproto.sync.defs#hostStatus` for two contrasting instances, the former extensible and the later more constrained - Take advantage of re-usable definitions, such as `com.atproto.repo.strongRef` (for versioned references to records) or `com.atproto.label.defs#label` (in an array, for hydrated labels) - API endpoints which take an account identifier as an argument (eg, query parameter) should use `at-identifier` so that clients can avoid calling `resolveHandle` if they only have an account handle - Record schemas should always use persistent identifiers (DIDs) for references to other accounts, instead of handles - API endpoints should always specify an `output` with `encoding`, even if they have no meaningful response data - a good default is `application/json` with the schema being an object with no defined properties - Optional `boolean` fields should be phrased such that `false` is the default and expected value - For example, if an endpoint can return a mix of “foo” and “bar”, and the common behavior is to include “foo” but not “bar”, then controlling parameters should be named `excludeFoo` (default `false`) and `includeBar` (default `false`), as opposed to `excludeBar` (default `true`) - Content hashes (CIDs) may be represented as a string format or in binary encoding (`cid-link`) - In most situations, including versioned references between records, the string format is recommended. - Binary encoding is mostly used for protocol-level mechanisms, such as the firehose.
ja: - 使えるなら文字列フィールドの形式（format）を指定してください - レコード内の文字列フィールドは、形式指定がない場合、ほとんどにおいて最大長を持つべきです - 形式と長さ制限で重複する指定をしないでください - 意味的または視覚的な理由で文字列の長さを制限する場合、書記素制限を使用して言語間である程度の一貫性を確保するべきです。この場合、データサイズ（バイト）の制限も追加してください。1書記素あたり10〜20バイトの比率が推奨されます。 - レコードにおける文字列型とバイト型は、データサイズ制約が強い用途向けです。より大きなサイズのテキストまたはバイナリデータの場合、blob参照を使用してください。これには、長文テキストや構造化データも含まれます。 - 列挙セットは「閉じている」ため、スキーマ進化ルールを破らずに更新または拡張することはできません。このため、ほとんどの場合で避けるべきです。 - 文字列の場合、`knownValues`はより柔軟な代替案を提供します - 文字列の`knownValues`には単純な文字列定数が含まれるか、`token`へのスキーマ参照が含まれる場合があります（例：`"com.example.defs#tokenOne"`という文字列） - トークンは拡張メカニズムを提供し、主観的な定義を持つ値や時間とともに拡張される可能性のある値に適しています - 例えば`com.atproto.moderation.defs#reasonType`と`com.atproto.sync.defs#hostStatus`を見比べると、前者の方が柔軟で、後者はより制約が強いです - `com.atproto.repo.strongRef`（レコードへのバージョン指定参照）や`com.atproto.label.defs#label`（配列内のハイドレートされたラベル）などの再利用可能な定義を活用してください - アカウント識別子を引数（例：クエリパラメータ）として受け取るAPIエンドポイントは、ハンドルしかない場合でもクライアントが`resolveHandle`を呼び出さなくていいように、`at-identifier`を使用するべきです - レコードスキーマは、他のアカウントへのリファレンスに対して、常にハンドルではなく永続的な識別子（DID）を使用すべきです - APIエンドポイントは、意味のあるレスポンスデータがない場合でも、常に`encoding`付きの`output`を指定すべきです - 良いデフォルトは`application/json`で、スキーマはプロパティ定義のないオブジェクトです - オプションの`boolean`フィールドは、`false`がデフォルト値および期待値となるように表現すべきです - 例えば、エンドポイントが「foo」と「bar」の混合を返すことができ、一般的な動作は「foo」を含めるが「bar」を含めない場合、制御パラメータは`excludeFoo`（デフォルト`false`）と`includeBar`（デフォルト`false`）という名前にして、`excludeBar`（デフォルト`true`）は使いません - コンテンツハッシュ（CID）は文字列型の形式またはバイナリエンコーディング（`cid-link`）で表現できます - レコード間のバージョン付き参照を含むほとんどの状況では、文字列形式が推奨されます。 - バイナリエンコーディングは主にfirehoseなどのプロトコルレベルのメカニズムに使用されます。

source: - Sync the profile records of all users so that you can show their display names instead of their handles. - Count the number of each status used and display the total counts. - Fetch the authed user's `app.bsky.graph.follow` follows and show statuses from them. - Create a different kind of schema, like a way to post links to websites and rate them 1 through 4 stars.
ja: - すべてのユーザーのプロフィールレコードを同期して、ハンドルではなく表示名を表示できるようにします。 - 使用された各ステータスの数をカウントし、合計数を表示します。 - 認証されたユーザーのフォロー`app.bsky.graph.follow`を取得し、それらのステータスを表示します。 - ウェブサイトへのリンクを投稿して1から4つ星で評価する方法など、別の種類のスキーマを作成します。

source: - The [indigo](https://github.com/bluesky-social/indigo) repository contains most of our Go tooling, including the code for the [Relay](https://github.com/bluesky-social/indigo/blob/main/cmd/relay/README.md) and the Go SDK. - There's also https://github.com/bluesky-social/goat, our Go AT command-line tool. - The https://github.com/bluesky-social/atproto repository contains most of our TypeScript tooling, including the code for the [PDS](https://github.com/bluesky-social/atproto/tree/main/packages/pds) and the TypeScript SDK. - There are many other community tools that we use every day. For example, the [Microcosm](https://www.microcosm.blue/) tooling, written in Rust, provides a set of APIs to help build query layers without requiring dedicated AppViews! Refer to https://constellation.microcosm.blue/ for details.
ja: - [indigo](https://github.com/bluesky-social/indigo)リポジトリには、[リレー](https://github.com/bluesky-social/indigo/blob/main/cmd/relay/README.md)のコードとGo SDKを含む、私たちのGoツールの大半が含まれています。 - 他にも私たちのGo製ATコマンドラインツールである https://github.com/bluesky-social/goat があります。 - https://github.com/bluesky-social/atproto リポジトリには、[PDS](https://github.com/bluesky-social/atproto/tree/main/packages/pds)のコードとTypeScript SDKを含む、TypeScriptツールの大半が含まれています。 - 私たちが日常的に使うコミュニティツールも多数あります。例えば、Rustで書かれた[Microcosm](https://www.microcosm.blue/)のツール群は、専用のAppViewを必要とせずにクエリ層を構築するためのAPI群を提供します。詳細は https://constellation.microcosm.blue/ を参照してください。

source: - The handle: `alice.com` - The DID: `did:plc:12345` - The hosting service: `https://alice.com`
ja: - ハンドル：`alice.com` - DID：`did:plc:12345` - ホスティング サービス：`https://alice.com`

source: - The handle: `alice.com` - The DID: `did:web:alice.com` - The hosting service: `https://alice.com`
ja: - ハンドル：`alice.com` - DID：`did:web:alice.com` - ホスティングサービス：`https://alice.com`

source: - The handle: `alice.pds.com` - The DID: `did:plc:12345` - The hosting service: `https://pds.com`
ja: - ハンドル：`alice.pds.com` - DID：`did:plc:12345` - ホスティングサービス：`https://pds.com`

source: - The loopback client metadata (for local development) - The production client metadata - The login route's authorize call
ja: - ループバッククライアントメタデータ（ローカル開発用） - 本番クライアントメタデータ - ログインルートのauthorize呼び出し
